# Напишіть программу "Касир в кінотеватрі", яка буде виконувати наступне:
#
# Попросіть користувача ввести свсвій вік (можно використати константу або input()).
# - якщо користувачу менше 7 - вивести "Де твої батьки?"
# - якщо користувачу менше 16 - вивести "Це фільм для дорослих!"
# - якщо користувачу більше 65 - вивести "Покажіть пенсійне посвідчення!"
# - якщо вік користувача складається з однакових цифр (11, 22, 44 і тд років, всі можливі варіанти!) - вивести
#  "Який цікавий вік!"
# - у будь-якому іншому випадку - вивести "А білетів вже немає!"

msg_for_child = 'Де твої батьки?'
msg_for_teen = 'Це фільм для дорослих!'
msg_for_pension = 'Покажіть пенсійне посвідчення!'
msg_result = 'А білетів вже немає!'
msg_joke = "Який цікавий вік!"

str_age = input('Введіть ваш вік: ')

# Перевірка на корректність введения віку користувачем. Вік має бути в межах від 1 до 99
if str_age.isdigit() and len(str_age) <= 2 and int(str_age) != 0:
    num_age = int(str_age)
    if num_age < 7:
        print(msg_for_child)
    elif num_age < 16 and int(str_age[0]) != int(str_age[1]):
        print(msg_for_teen)
    elif num_age > 65 and int(str_age[0]) != int(str_age[1]):
        print(msg_for_pension)
    elif int(str_age[0]) == int(str_age[1]):
        print(msg_joke)
    else:
        print(msg_result)
else:
    print('Перевірте правильнітсь вводу вашого віку!\n'
          'Для вводу доступін тільци цифри від 1 до 99')